---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidRoofCurveloopError
source: html/c4b258f6-8845-8933-3321-a2a1633e3a77.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidRoofCurveloopError Property

Base sketch for roof is invalid

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidRoofCurveloopError { get; }
```